In [1]:
import pandas as pd
import numpy as np

In [2]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [3]:
df

                   A         B         C         D
2013-01-01  1.145295 -0.816377 -1.221115 -0.036376
2013-01-02  1.009167 -0.516463 -1.209339 -0.068845
2013-01-03 -0.287561  0.080210  0.293584 -0.747895
2013-01-04 -1.647970 -0.062358  1.056662 -1.903607
2013-01-05 -0.333595  0.661945 -0.231396  0.126650
2013-01-06 -0.728635 -1.049196 -1.559210 -1.242594

In [6]:
df2 = pd.DataFrame({'A': 1.,
 'B': pd.Timestamp('20130102'),
 'C': pd.Series(1, index=list(range(4)), dtype='float32'),
 'D': np.array([3] * 4, dtype='int32'),
 'E': pd.Categorical(["test", "train", "test", "train"]),
 'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [4]:
df['A'] > 0

2013-01-01     True
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [5]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  1.145295 -0.816377 -1.221115 -0.036376
2013-01-02  1.009167 -0.516463 -1.209339 -0.068845

In [6]:
df > 0

                A      B      C      D
2013-01-01   True  False  False  False
2013-01-02   True  False  False  False
2013-01-03  False   True   True  False
2013-01-04  False  False   True  False
2013-01-05  False   True  False   True
2013-01-06  False  False  False  False

In [7]:
df[df > 0]

                   A         B         C        D
2013-01-01  1.145295       NaN       NaN      NaN
2013-01-02  1.009167       NaN       NaN      NaN
2013-01-03       NaN  0.080210  0.293584      NaN
2013-01-04       NaN       NaN  1.056662      NaN
2013-01-05       NaN  0.661945       NaN  0.12665
2013-01-06       NaN       NaN       NaN      NaN

In [8]:
df2 = df.copy()

In [9]:
df2

                   A         B         C         D
2013-01-01  1.145295 -0.816377 -1.221115 -0.036376
2013-01-02  1.009167 -0.516463 -1.209339 -0.068845
2013-01-03 -0.287561  0.080210  0.293584 -0.747895
2013-01-04 -1.647970 -0.062358  1.056662 -1.903607
2013-01-05 -0.333595  0.661945 -0.231396  0.126650
2013-01-06 -0.728635 -1.049196 -1.559210 -1.242594

In [10]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [11]:
df2

                   A         B         C         D      E
2013-01-01  1.145295 -0.816377 -1.221115 -0.036376    one
2013-01-02  1.009167 -0.516463 -1.209339 -0.068845    one
2013-01-03 -0.287561  0.080210  0.293584 -0.747895    two
2013-01-04 -1.647970 -0.062358  1.056662 -1.903607  three
2013-01-05 -0.333595  0.661945 -0.231396  0.126650   four
2013-01-06 -0.728635 -1.049196 -1.559210 -1.242594  three

In [12]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [13]:
df['F'] = s1

In [14]:
df.at[dates[0], 'A'] = 0

In [15]:
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.816377 -1.221115 -0.036376  NaN
2013-01-02  1.009167 -0.516463 -1.209339 -0.068845  1.0
2013-01-03 -0.287561  0.080210  0.293584 -0.747895  2.0
2013-01-04 -1.647970 -0.062358  1.056662 -1.903607  3.0
2013-01-05 -0.333595  0.661945 -0.231396  0.126650  4.0
2013-01-06 -0.728635 -1.049196 -1.559210 -1.242594  5.0

In [16]:
df.iat[0, 1] = 0

In [17]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -1.221115 -0.036376  NaN
2013-01-02  1.009167 -0.516463 -1.209339 -0.068845  1.0
2013-01-03 -0.287561  0.080210  0.293584 -0.747895  2.0
2013-01-04 -1.647970 -0.062358  1.056662 -1.903607  3.0
2013-01-05 -0.333595  0.661945 -0.231396  0.126650  4.0
2013-01-06 -0.728635 -1.049196 -1.559210 -1.242594  5.0

In [18]:
len(df)

6

In [19]:
[5] * len(df)

[5, 5, 5, 5, 5, 5]

In [20]:
np.array([5] * len(df))

array([5, 5, 5, 5, 5, 5])

In [21]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [22]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.221115  5  NaN
2013-01-02  1.009167 -0.516463 -1.209339  5  1.0
2013-01-03 -0.287561  0.080210  0.293584  5  2.0
2013-01-04 -1.647970 -0.062358  1.056662  5  3.0
2013-01-05 -0.333595  0.661945 -0.231396  5  4.0
2013-01-06 -0.728635 -1.049196 -1.559210  5  5.0

In [23]:
dates[0:4]

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04'], dtype='datetime64[ns]', freq='D')

In [24]:
list(df.columns)

['A', 'B', 'C', 'D', 'F']

In [26]:
list(df.columns)+['E']

['A', 'B', 'C', 'D', 'F', 'E']

In [27]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000 -1.221115  5  NaN NaN
2013-01-02  1.009167 -0.516463 -1.209339  5  1.0 NaN
2013-01-03 -0.287561  0.080210  0.293584  5  2.0 NaN
2013-01-04 -1.647970 -0.062358  1.056662  5  3.0 NaN

In [28]:
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.221115  5  NaN  1.0
2013-01-02  1.009167 -0.516463 -1.209339  5  1.0  1.0
2013-01-03 -0.287561  0.080210  0.293584  5  2.0  NaN
2013-01-04 -1.647970 -0.062358  1.056662  5  3.0  NaN

In [29]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  1.009167 -0.516463 -1.209339  5  1.0  1.0

In [30]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.221115  5  5.0  1.0
2013-01-02  1.009167 -0.516463 -1.209339  5  1.0  1.0
2013-01-03 -0.287561  0.080210  0.293584  5  2.0  5.0
2013-01-04 -1.647970 -0.062358  1.056662  5  3.0  5.0

In [31]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [32]:
df.mean()

A   -0.331432
B   -0.147644
C   -0.478469
D    5.000000
F    3.000000
dtype: float64

In [33]:
df.mean(1)

2013-01-01    0.944721
2013-01-02    1.056673
2013-01-03    1.417247
2013-01-04    1.469267
2013-01-05    1.819391
2013-01-06    1.332592
Freq: D, dtype: float64

In [34]:
pd.Series([1, 3, 5, np.nan, 6, 8], index=dates)

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [35]:
pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [36]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [37]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.287561 -0.919790 -0.706416  4.0  1.0
2013-01-04 -4.647970 -3.062358 -1.943338  2.0  0.0
2013-01-05 -5.333595 -4.338055 -5.231396  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [38]:
np.cumsum

In [39]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -1.221115   5   NaN
2013-01-02  1.009167 -0.516463 -2.430454  10   1.0
2013-01-03  0.721605 -0.436253 -2.136870  15   3.0
2013-01-04 -0.926365 -0.498611 -1.080208  20   6.0
2013-01-05 -1.259959  0.163334 -1.311605  25  10.0
2013-01-06 -1.988594 -0.885861 -2.870815  30  15.0

In [42]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.221115  5  NaN
2013-01-02  1.009167 -0.516463 -1.209339  5  1.0
2013-01-03 -0.287561  0.080210  0.293584  5  2.0
2013-01-04 -1.647970 -0.062358  1.056662  5  3.0
2013-01-05 -0.333595  0.661945 -0.231396  5  4.0
2013-01-06 -0.728635 -1.049196 -1.559210  5  5.0

In [41]:
df.apply(lambda x: x.max() - x.min())

A    2.657137
B    1.711141
C    2.615872
D    0.000000
F    4.000000
dtype: float64

In [43]:
np.random.randint(0, 7, size=10)

array([0, 1, 1, 0, 4, 3, 0, 4, 0, 1])

In [44]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    3
1    1
2    4
3    6
4    4
5    4
6    0
7    3
8    1
9    1
dtype: int32

In [45]:
s.value_counts()

4    3
1    3
3    2
6    1
0    1
dtype: int64

In [46]:
['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat']

['A', 'B', 'C', 'Aaba', 'Baca', nan, 'CABA', 'dog', 'cat']

In [47]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [48]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [49]:
df = pd.DataFrame(np.random.randn(10, 4))

In [50]:
df

          0         1         2         3
0  1.077347  0.836685 -0.319520  0.345731
1 -1.832736 -0.888924 -0.827251 -0.077427
2  1.678547  1.179989 -0.458652  0.693507
3 -0.214540  0.627330  0.780912 -0.022873
4 -1.098409 -0.433007  1.216862 -0.061105
5  1.249577 -1.877380 -0.652521 -1.441942
6  1.275254 -0.743687 -0.051124 -0.157092
7 -0.630881 -0.199824  2.123711  0.758460
8  0.645477 -0.058648  1.467125  0.698597
9 -0.061078  0.877859 -0.002078  0.763601

In [51]:
df[:3]

          0         1         2         3
0  1.077347  0.836685 -0.319520  0.345731
1 -1.832736 -0.888924 -0.827251 -0.077427
2  1.678547  1.179989 -0.458652  0.693507

In [52]:
df[3:7]

          0         1         2         3
3 -0.214540  0.627330  0.780912 -0.022873
4 -1.098409 -0.433007  1.216862 -0.061105
5  1.249577 -1.877380 -0.652521 -1.441942
6  1.275254 -0.743687 -0.051124 -0.157092

In [53]:
df[7:]

          0         1         2         3
7 -0.630881 -0.199824  2.123711  0.758460
8  0.645477 -0.058648  1.467125  0.698597
9 -0.061078  0.877859 -0.002078  0.763601

In [54]:
pieces = [df[:3], df[3:7], df[7:]]

In [55]:
pieces

[          0         1         2         3
 0  1.077347  0.836685 -0.319520  0.345731
 1 -1.832736 -0.888924 -0.827251 -0.077427
 2  1.678547  1.179989 -0.458652  0.693507,
           0         1         2         3
 3 -0.214540  0.627330  0.780912 -0.022873
 4 -1.098409 -0.433007  1.216862 -0.061105
 5  1.249577 -1.877380 -0.652521 -1.441942
 6  1.275254 -0.743687 -0.051124 -0.157092,
           0         1         2         3
 7 -0.630881 -0.199824  2.123711  0.758460
 8  0.645477 -0.058648  1.467125  0.698597
 9 -0.061078  0.877859 -0.002078  0.763601]

In [56]:
pd.concat(pieces)

          0         1         2         3
0  1.077347  0.836685 -0.319520  0.345731
1 -1.832736 -0.888924 -0.827251 -0.077427
2  1.678547  1.179989 -0.458652  0.693507
3 -0.214540  0.627330  0.780912 -0.022873
4 -1.098409 -0.433007  1.216862 -0.061105
5  1.249577 -1.877380 -0.652521 -1.441942
6  1.275254 -0.743687 -0.051124 -0.157092
7 -0.630881 -0.199824  2.123711  0.758460
8  0.645477 -0.058648  1.467125  0.698597
9 -0.061078  0.877859 -0.002078  0.763601

In [58]:
pd.concat([df[:3], df[7:]])

          0         1         2         3
0  1.077347  0.836685 -0.319520  0.345731
1 -1.832736 -0.888924 -0.827251 -0.077427
2  1.678547  1.179989 -0.458652  0.693507
7 -0.630881 -0.199824  2.123711  0.758460
8  0.645477 -0.058648  1.467125  0.698597
9 -0.061078  0.877859 -0.002078  0.763601

In [59]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [60]:
left

   key  lval
0  foo     1
1  foo     2

In [61]:
right

   key  rval
0  foo     4
1  foo     5

In [62]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [63]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [64]:
left

   key  lval
0  foo     1
1  bar     2

In [65]:
right

   key  rval
0  foo     4
1  bar     5

In [66]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5